Repository: fabianjra/MentalMood
Catalog: SereneCheck/*.lproj/Localizable.strings
Languages: es

source: Moods registered
es: Moods registrados

source: Tasks registered
es: Tareas registradas

source: Tasks completed
es: Tareas completadas

source: Press the + button to start
es: Presiona el botón + para comenzar

source: Delete
es: Eliminar

source: Date
es: Fecha

source: Current
es: Actual

source: Pending
es: Pendiente

source: Completed
es: Completado

source: How do you feel today?
es: ¿Como te sientes hoy?

source: Write your current mood so we can create for you a checklist of tasks that could help you to bring back your serene state or to maintain it.
es: Escribe tu estado de ánimo actual para que podamos crear para ti una lista de tareas que podrían ayudarte a recuperar tu estado de animo o a mantenerlo.

source: I feel....
es: Me siento...

source: Add mood
es: Agregar animo

source: How is your mood?
es: ¿Cómo te sientes?

source: START
es: Comenzar

source: Tell us about your mood and get a checklist to steps that can help you improve your mood!
es: ¡Cuéntenos sobre su estado de ánimo y obtenga una lista de pasos que pueden ayudarlo a mejorar su estado de ánimo!

source: We are generating your checklist, it may take a while.
es: Se esta generando la lista, podría tardar un poco.

source: I couldn't identify your mood, could you talk about how you feel?
es: No pude identificar tu estado de ánimo, ¿Podrías hablar de cómo te sientes?

source: We are having trouble with our bots.
es: Estamos teniendo problemas con nuestros bots.

source: footer_modal
es: Esta es una lista de tareas que podrias realizar para mejorar tu estado de ánimo

source: confirm_checklist_text
es: Si crees que ésta lista de tareas funciona para ti por favor confirma.

source: confirm_checklist_button
es: Confirmar Lista

source: rules.header
es: Eres un bot que ayuda al usuario a crear una lista de pasos para mejorar su estado de ánimo en función del sentimiento positivo o negativo identificado en el texto ingresado por el usuario. Las reglas son:

source: rules.line.1
es: 1) Identificar el estado de ánimo, si éste tiene un sentimiento negativo, crear una lista de 5 pasos recomendados para mejorar el estado de ánimo.

source: rules.line.2
es: 2) Si el estado de ánimo tiene un sentimiento positivo, mostrarás un listado de 3 pasos para mantener ese sentimiento.

source: rules.line.3
es: 3) En caso de que el usuario no hable sobre su propio estado del animo, pedirle que intente de nuevo hablar sobre su estado de ánimo.

source: rules.line.4
es: 4) Los pasos recomendados deben estar enumerados (por ejemplo: '1. Lee un libro cuando te sientas triste'), y cada paso debe tener máximo 20 palabras.

source: rules.line.5
es: La respuesta del bot debe ser en formato JSON en una sola línea, sin saltos de línea ni identación, sin excepción. La estructura JSON debe tener exactamente tres propiedades con la siguiente información:

source: rules.line.6
es: 'header': mensaje que invite al usuario a seguir los pasos recomendados (incisos 1 y 2) o para invitar al usuario a que hable sobre su estado de ánimo (inciso 3)

source: rules.line.7
es: 'checklist': un arreglo con los pasos recomendados (incisos 1 y 2), o un arreglo vacío en caso de que aplique la regla del inciso 3.

source: rules.line.8
es: 'footer': mensaje de despedida (incisos 1 y 2) o una cadena vacío en caso de que aplique la regla del inciso 3.

source: rules.line.9
es: Ninguna propiedad debe ser null. Todas las propiedades deben estar presentes en la estructura.

source: user.label
es: Usuario:

source: json.response
es: Respuesta JSON:

source: current.mood.label
es: Escriba su estado de ánimo actual, así podemos crear para usted una lista de tareas que podrían ayudarte a recuperar tu estado de serenidad o a mantenerlo.
